Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བྱ་བ་དཔག་ཏུ་མེད་པའི་ཕྱིར་ཉེ་བར་གནས་པའོ།
en: This perfection of wisdom is established for an inestimable purpose.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བྱ་བ་གཞལ་དུ་མེད་པའི་ཕྱིར་ཉེ་བར་གནས་པའོ།
en: This perfection of wisdom is established for an unappraisable purpose.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བྱ་བ་མི་མཉམ་པ་དང་མཉམ་པའི་ཕྱིར་ཉེ་བར་གནས་པའོ།
en: This perfection of wisdom is established for a purpose that is equal to the unequaled.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ནི། གཟུགས་ལ་ཡོངས་སུ་འཛིན་པ་མེད་པ་དང་། མངོན་པར་ཆགས་པ་མེད་པར་ཉེ་བར་གནས་པའོ།
en: If you ask why, Subhūti, it is because this profound perfection of wisdom is established in order that one might not appropriate or become fixated on physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་ཡོངས་སུ་འཛིན་པ་མེད་པ་དང་། མངོན་པར་ཆགས་པ་མེད་པར་ཉེ་བར་གནས་པའོ།
en: It is established in order that one might not appropriate or become fixated on feelings, perceptions, formative predispositions, and consciousness.

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་ལ་ཡོངས་སུ་འཛིན་པ་མེད་པ་དང་། མངོན་པར་ཆགས་པ་མེད་པར་ཉེ་བར་གནས་པའོ།
en: It is established in order that one might not appropriate or become fixated on [all the causal and fruitional attributes], up to and including the eighteen distinct qualities of the buddhas.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་ལ་ཡོངས་སུ་འཛིན་པ་མེད་པ་དང་།
en: It is established in order that one might not appropriate or become fixated on [all the goals], up to and including unsurpassed, complete enlightenment.” “

source: མངོན་པར་ཆགས་པ་མེད་པར་ཉེ་བར་གནས་པའོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གཟུགས་ལ་ཡོངས་སུ་འཛིན་པ་མ་མཆིས་པ་དང་། མངོན་པར་ཆགས་པ་མ་མཆིས་པར་ཉེ་བར་གནས་པ་ལགས།
en: Blessed Lord, how is this perfection of wisdom established in order that one might not appropriate or become fixated on physical forms?

source: ཇི་ལྟར་ན་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་ཡོངས་སུ་འཛིན་པ་མ་མཆིས་པ་དང་། མངོན་པར་ཆགས་པ་མ་མཆེས་པར་ཉེ་བར་གནས་པ་ལགས།
en: How is it established in order that one might not appropriate or become fixated on feelings, perceptions, formative predispositions, or consciousness?

source: ཇི་ལྟར་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་ལ་ཡོངས་སུ་འཛིན་པ་མ་མཆིས་པ་དང་། མངོན་པར་ཆགས་པ་མ་མཆིས་པར་ཉེ་བར་གནས་པ་ལགས།
en: How is it established in order that one might not appropriate or become fixated on [all the attributes and goals], up to and including unsurpassed, complete enlightenment?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། ཁྱོད་ཀྱིས་གཟུགས་གང་ཡོངས་སུ་གཟུང་བར་བྱ་བ་འམ། མངོན་པར་ཆགས་པར་བྱ་བ་དེ་ལྟ་བུ་མཐོང་ངམ།
en: Subhūti,” replied the Blessed One, “do you observe any physical forms that one could appropriate or become fixated upon?

source: ཆོས་གང་ཡོངས་སུ་འཛིན་པ་བྱེད་པ་དང་། མངོན་པར་ཆགས་པར་བྱེད་པའམ། གང་གིས་ཡོངས་སུ་གཟུང་བར་བྱ་བ་འམ། མངོན་པར་ཆགས་པར་བྱ་བ་དེ་ལྟ་བུ་ཡང་མཐོང་ངམ། གསོལ་པ།
en: Do you observe anything that one could appropriate or become fixated upon, or anything by which one could appropriate or become fixated?” “

source: བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས།
en: No, Blessed Lord!” “

source: ཁྱོད་ཀྱིས་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་གང་ཡོངས་སུ་གཟུང་བར་བྱ་བ་འམ། མངོན་པར་ཆགས་པར་བྱ་བ་དེ་ལྟ་བུ་མཐོང་ངམ།
en: Subhūti, do you observe any feelings, perceptions, formative predispositions, or consciousness that one could appropriate or become fixated upon?

source: ཆོས་གང་ཡོངས་སུ་འཛིན་པར་བྱེད་པ་དང་། མངོན་པར་ཆགས་པར་བྱེད་པའམ། གང་གིས་ཡོངས་སུ་གཟུང་བར་བྱ་བ་འམ། མངོན་པར་ཆགས་པར་བྱ་བ་དེ་ལྟ་བུ་ཡང་མཐོང་ངམ།
en: Do you observe anything that one could appropriate or become fixated upon, or anything by which one could appropriate or become fixated?”

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། ཁྱོད་ཀྱིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་གང་ཡོངས་སུ་གཟུང་བར་བྱ་བ་འམ། མངོན་པར་ཆགས་པར་བྱ་བ་དེ་ལྟ་དུ་ཡང་མཐོང་ངམ།
en: Subhūti, do you observe any [attributes or goals], up to and including all-aspect omniscience, that one could appropriate or become fixated upon?

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། ཁྱོད་ཀྱིས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་ཡོངས་སུ་གཟུང་བར་བྱ་བ་འམ། མངོན་པར་ཆགས་པར་བྱ་བ་དེ་ལྟ་བུ་མཐོང་ངམ།
en: Subhūti, do you observe any fruit of entering the stream to nirvāṇa that one could appropriate or become fixated upon?

source: ཆོས་གང་ཡོངས་སུ་འཛིན་པར་བྱེད་པ་དང་། མངོན་པར་ཆགས་པར་བྱེད་པ་འམ། གང་གིས་ཡོངས་སུ་གཟུང་བར་བྱ་བ་འམ། མངོན་པར་ཆགས་པར་བྱ་བ་དེ་ལྟ་བུ་ཡང་མཐོང་ངམ།
en: Do you observe anything that one could appropriate or become fixated upon, or anything by which one could appropriate or become fixated?”

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། ཁྱོད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་གང་ཡོངས་སུ་གཟུང་བར་བྱ་བ་འམ། མངོན་པར་ཆགས་པར་བྱ་བ་དེ་ལྟ་བུ་མཐོང་ངམ།
en: Subhūti, do you observe any [other fruit or goal, up to and including] unsurpassed, complete enlightenment, that one could appropriate or become fixated upon?

source: རབ་འབྱོར་ལེགས་སོ་ལེགས་སོ། རབ་འབྱོར་ངས་ཀྱང་གཟུགས་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་སྟེ།
en: Subhūti, I also do not observe physical forms.

source: ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བས་ཡོངས་སུ་མི་འཛིན།
en: Since I do not observe them, I do not appropriate them.

source: ཡོངས་སུ་མི་འཛིན་པས་ཉེ་བར་མི་ལེན་ཏོ།
en: Since I do not appropriate them, I do not grasp them.

source: །རབ་འབྱོར་ངས་ཀྱང་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་སྟེ།
en: Subhūti, I also do not observe feelings, perceptions, formative predispositions, or consciousness.

source: །རབ་འབྱོར་ངས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་སྟེ།
en: Subhūti, I also do not observe [the attributes or goals], {Ki.IV: 79} up to and including unsurpassed, complete enlightenment.

source: རབ་འབྱོར་ངས་ཀྱང་སངས་རྒྱས་ཀྱིས་དང་། ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་། དེ་བཞིན་གཤེགས་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་སྟེ།
en: Subhūti, I also do not observe the buddha level, knowledge of all the dharmas, all-aspect omniscience, or the nature of the tathāgatas.

source: རབ་འབྱོར་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། གཟུགས་ལ་མངོན་པར་ཆགས་པར་མི་བྱའོ། ཡོངས་སུ་གཟུང་བར་མི་བྱའོ།
en: So it is, Subhūti, that bodhisattva great beings should not become fixated on physical forms and should not appropriate them.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་མངོན་པར་ཆགས་པར་མི་བྱའོ། །ཡོངས་སུ་གཟུང་བར་མི་བྱའོ།
en: They should not become fixated on feelings, perceptions, formative predispositions, or consciousness and should not appropriate them.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལ་མངོན་པར་ཆགས་པར་མི་བྱའོ། །ཡོངས་སུ་གཟུང་བར་མི་བྱའོ། །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུ
en: They should not become fixated on the sense fields, the sensory elements, or the links of dependent origination and should not appropriate them.

source: མ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་མངོན་པར་ཆགས་པར་མི་བྱའོ།
en: They should not become fixated on any of the perfections, any of the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, or the eighteen distinct qualities of the buddhas, and should not appropriate them.

source: །ཡོངས་སུ་གཟུང་བར་མི་བྱའོ། །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་ལ་མངོན་པར་ཆགས་པར་མི་བྱའོ། །ཡོངས་སུ་གཟུང་བར་མི་བྱའོ།
en: They should not become fixated on [the goals], up to and including unsurpassed, complete enlightenment, and should not appropriate them.

source: །སངས་རྒྱས་ཉིད་དང་། ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་། དེ་བཞིན་གཤེགས་པ་ཉིད་ལ་མངོན་པར་ཆགས་པར་མི་བྱའོ། །ཡོངས་སུ་གཟུང་བར་མི་བྱའོ།
en: They should not become fixated on buddhahood, knowledge of all the dharmas, all-aspect omniscience, or the nature of the tathāgatas, and should not appropriate them.”

source: །དེ་ནས་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ཡོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་དག་གིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི། ཟབ་ཅིང་བལྟ་དཀའ་ལ།
en: Then the gods inhabiting the realm of desire and those inhabiting the realm of form said to the Blessed One, “Blessed Lord, this perfection of wisdom is profound, hard to discern, and hard to realize!

source: རྟོགས་པར་དཀའ་བ་སྟེ།
en: It cannot be investigated and it is not within the range of sophistry.

source: མི་རྟག་པ་བརྟག་པའི་སྤྱོད་ཡུལ་མ་ལགས་པ་ཞི་ཞིང་ཕྲ་ལ།
en: It is at peace and subtle.

source: མཁས་པ་དང་། བྱང་བ་དང་། ཡིད་གསལ་བས་འཚལ་བར་བགྱི་བའོ།
en: It can be known by the learned, the refined, and the clear-minded.

source: །བཅོམ་ལྡན་འདས་སེམས་ཅན་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ། མོས་པ་དེ་དག་ནི། སྔོན་གྱི་རྒྱལ་བ་ལ་བགྱི་བ་བགྱིས་པའོ་བཅོམ་ལྡན་འདས་སེམས་ཅན་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་མོས་པ་དེ་དག་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བའོ།
en: Blessed Lord, those beings who are inclined toward this profound perfection of wisdom have fulfilled their duties in the presence of the conquerors of the past.

source: །དགེ་བའི་རྩ་བ་བསྐྱེད་པའོ།
en: Blessed Lord, those beings who are inclined toward this profound perfection of wisdom have been accepted by spiritual mentors, and they have planted the roots of virtuous actions. “

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་དད་པའི་རྗེས་སུ་འབྲང་བ་དང་། ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བརྒྱད་པ་དང་། རྒྱུན་ཏུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་སུ་གྱུར་ཏེ། དེ་དག་ཐམས་ཅད་ལ་ཡེ་ཤེས་དང་།
en: Blessed Lord, comparing the entire cognition and exertion of all those beings in the world systems of the great trichiliocosm, as many as there are, who have become followers through faith, who have become followers of the Dharma, who have reached the eighth level, who have entered the stream to nirvāṇa, who are destined for only one more rebirth, who are no longer subject to rebirth, who have attained arhatship, and who have become pratyekabuddhas, {Ki.

source: སྤོང་བ་གང་ཇི་སྙེད་ཅིག་མཆིས་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་གདུགས་གཅིག་ཏུ་མོས་ཤིང་བསམས་ཏེ། གཞལ་བ་དང་། བརྟག་པ་དང་། དཔྱད་པ་ཉིད་ལ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་གདུགས་གཅིག་ཏུ་མོས་པ་དེ་ཉིད་ཆེས་ལེགས་པའི་མཆོག་ཏུ་འགྱུར་རོ།
en: IV: 80} with that of anyone who is inclined toward this profound perfection of wisdom for the duration of a single day, thinking of it, appraising it, examining it, or investigating it, this inclination [of the latter] toward the profound perfection of wisdom for the duration of a single day will be superior.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་ནི་འདི་ལྟར་དད་པའི་རྗེས་སུ་འབྲང་བ་དང་། ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བརྒྱད་པ་དང་། རྒྱུན་ཏུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་གང་ཇི་ཙམ་པ་དང་། སྤོང་བ་གང་ཇི་ཙམ་པ་དེ་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པའི་བཟོད་པར་འདུས་སོ།
en: If you ask why, it is because the full extent of the cognition and the full extent of the exertion of those who have become followers through faith, and those who have become followers of the Dharma, who have reached the eighth level, who have entered the stream to nirvāṇa, who are destined for only one more rebirth, who are no longer subject to rebirth, who have attained arhatship, and who have become pratyekabuddhas, is subsumed in the receptivity of bodhisattva great beings who have accepted that phenomena are nonarising.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ཡོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་དེ་དག་ལ་བཀའ་སྩལ་པ། ལྷའི་བུ་དག་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ། དད་པའི་རྗེས་སུ་འབྲང་བ་དང་། ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་།
en: Then the Blessed One addressed those gods inhabiting the realm of desire and those gods inhabiting the realm of form as follows: “O gods!

source: བརྒྱད་པ་དང་།
en: It is so!

source: རྒྱུན་ཏུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་།
en: It is so!

source: ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་གང་ཇི་ཙམ་པ་དང་། སྤོང་བ་གང་ཇི་ཙམ་པ་དེ་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པའི་བཟོད་པར་འདུས་སོ། །ལྷའི་བུ་དག་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་སུ་ཡང་རུང་སྟེ།
en: The full extent of the cognition and the full extent of the exertion of those who have become followers through faith, and those who have become followers of the Dharma, who have reached the eighth level, who have entered the stream to nirvāṇa, who are destined for only one more rebirth, who are no longer subject to rebirth, who have attained arhatship, and who have become pratyekabuddhas, is subsumed in the receptivity of bodhisattva great beings who have accepted that phenomena are nonarising.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཉན་ཅིང་ཐོས་ནས་འདྲི་བ་དང་། བྲིས་ནས་ལུང་འབོག་པ་དང་། ཁ་ཏོན་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དེ་དག་ནི་མྱུར་དུ་འབྱུང་བར་ཤེས་པར་བྱའི། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་བ། མདོ་སྡེ་གཞན་ལ་བསྐལ་པའམ། བསྐལ་པའི་ལྷག་མར་སྤྱོད་པ་དག་ནི་མ་ཡིན་ནོ།
en: O gods, one should know that any noble sons or noble daughters who have heard this profound perfection of wisdom, and who, having heard it, aspire toward it, and who, having aspired toward it, commit it to writing, and having committed it to writing, transmit and disseminate it, focusing their attention correctly on it, will swiftly be emancipated, and not those noble sons or noble daughters who are followers of the vehicles of the śrāvakas and pratyekabuddhas, and who practice according to other sūtras, apart from the perfection of wisdom, for an eon or longer than an eon.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལས་ཕུལ་དུ་བྱ་བའི་ཆོས་གང་ལ། དད་པའི་རྗེས་སུ་འབྲང་བ་དང་། ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བརྒྱད་པ་དང་། རྒྱུན་ཏུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་།
en: If you ask why, it is because those who have become followers through faith, and those who have become followers of the Dharma, who have reached the eighth level, who have entered the stream to nirvāṇa, who are destined for only one more rebirth, who are no longer subject to rebirth, who have attained arhatship, and who have become pratyekabuddhas should train in the attributes that are to be perfected through this profound perfection of wisdom.

source: དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱིས་བསླབ་པར་བྱ་བ་དང་། གང་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་བསླབ་པར་བྱ་བ་དང་། གང་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་བསླབས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དང་།
en: Bodhisattva great beings should train in them—it is extensively revealed that, having trained in them, the tathāgatas, arhats, completely awakened buddhas have attained consummate buddhahood in unsurpassed, complete enlightenment, will attain consummate buddhahood, and are attaining consummate buddhahood.”

source: མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དང་། མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དེ་དག་རྒྱ་ཆེར་བསྟན་ཏོ། །དེ་ནས་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ཡོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་དེ་དག་གིས་ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་བརྗོད་དེ།
en: Then the gods inhabiting the realm of desire and those inhabiting the realm of form pronounced the following meaningful proclamation: “Blessed Lord, this perfection of wisdom is the great perfection.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི། ཕ་རོལ་དུ་ཕྱིན་པ་ཆེན་མོ་སྟེ། བཅོམ་ལྡན་འདས་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི། དཔག་ཏུ་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: Blessed Lord, this perfection of wisdom is the inestimable perfection.

source: །འདི་ནི་གཞལ་དུ་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: This is the unappraisable perfection.

source: །འདི་ནི་མི་མཉམ་པ་དང་མཉམ་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟེ།
en: This is the perfection that is equal to the unequaled.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་དེ་ལ་བསླབས་ཤིང་། དད་པའི་རྗེས་སུ་འབྲང་བ་རྣམས་བྱུང་བར་གྱུར་ཏེ། འབྱུང་ཞིང་འབྱུང་བར་འགྱུར། ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བརྒྱད་པ་དང་། རྒྱུན་ཏུ་ཞུགས་པ་དང་།
en: Blessed Lord, it is having trained in this profound perfection of wisdom that those who have become followers through faith have been emancipated, are emancipated, and will be emancipated, and that those who have become followers of the Dharma, who have reached the eighth level, who have entered the stream to nirvāṇa, who are destined for only one more rebirth, who are no longer subject to rebirth, and who have attained arhatship have been emancipated, are emancipated, and will be emancipated.

source: ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་རྣམས་བྱུང་བར་གྱུར་ཏེ། འབྱུང་ཞིང་འབྱུང་བར་འགྱུར། དེ་ལ་བསླབས་ཤིང་རང་སངས་རྒྱས་རྣམས་བྱུང་བར་གྱུར་ཏེ།
en: It is having trained in it that pratyekabuddhas have been emancipated, are emancipated, and will be emancipated. {

source: འབྱུང་ཞིང་འབྱུང་བར་འགྱུར།
en: Ki.

source: དེ་ལ་བསླབས་ཤིང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བྱུང་བར་གྱུར་ཏེ། འབྱུང་ཞིང་འབྱུང་བར་འགྱུར།
en: IV: 81} It is having trained in it that bodhisattva great beings have attained, are attaining, and will attain unsurpassed, complete enlightenment.

source: ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འགྲིབ་པའམ། འཕེལ་བར་ཡང་མི་གངའོ་ཞེས་ནས་འདོད་པ་ན་སྤྱོད་པ་དང་།
en: This profound perfection of wisdom is neither diminished nor replenished.”

source: གཟུགས་ཡོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་དུ་གཡས་ཕྱོགས་ནས་བསྐོར་ནས། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་དོང་སྟེ།
en: Then the gods inhabiting the realm of desire and those inhabiting the realm of form prostrated with their heads toward the feet of the Blessed One, and circumambulated the Blessed One three times from the right, before departing from his presence.

source: དེ་དག་ཤིན་ཏུ་ཡང་མི་རིང་བ་ཞིག་དུ་ཕྱིན་ནས་མི་སྣང་བར་གྱུར་ཏེ། འདོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་དག་ནི་འདོད་པའི་ཁམས་སུ་འཁོད་དོ། །གཟུགས་ཡོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་དག་ནི་གཟུགས་ཡོད་པའི་ཁམས་སུ་འཁོད་དོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Having gone not very far, they disappeared, the gods inhabiting the realm of desire proceeding to the realm of desire, and the gods inhabiting the realm of form proceeding to the realm of form.

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཐོས་མ་ཐག་ཏུ་མོས་པར་འགྱུར་ཞིང་། གོང་དུ་འདྲི་བ་དང་། འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་ཅིང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་ན། དེ་གང་ནས་ཤི་འཕོས་ཏེ་འདིར་སྐྱེས་པར་གྱུར་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Then the venerable Subhūti asked the Blessed One, “Blessed Lord, if bodhisattva great beings who have heard this perfection of wisdom, immediately afterward are inclined toward it, and, as mentioned before, commit it to writing, take up, uphold, recite, master, and focus their attention correctly on it, from where will they pass away and be reborn into this [human world]?” “

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཐོས་མ་ཐག་ཏུ་མོས་ཤིང་ཞུམ་པར་མི་འགྱུར། ཡོངས་སུ་ཞུམ་པར་མི་འགྱུར་ལ། རྨོངས་པར་མི་འགྱུར་ཞིང་ཐེ་ཙོམ་མི་ཟ། ནེམ་ནུར་མི་བྱེད་ལ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཉན་པར་མངོན་པར་དགའ་ཞིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཐོས་ནས་ཀྱང་ཡིད་ལ་བྱ་བ་དེ་དག་དང་བྲལ་བར་མི་བྱེད་ལ། ཡིད་ལ་བྱ་བ་དེ་དག་འགྲོ་འམ། འོང་འམ། འགྲེང་ངམ། འདུག་གམ། ཉལ་ཀྱང་རུང་སྟེ། རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་བསྲུང་འཇིག་པར་མི་བྱེད་ཅིང་། ཆོས་སྨྲ་བའི་གང་ཟག་དེ་ལ་ཡང་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་འབྲང་སྟེ། རབ་འབྱོར་དཔེར་ན། བ་དྲུས་མ་བེའུ་མི་འདོར་བ་ལྟར།
en: Subhūti,” replied the Blessed One, “bodhisattva great beings who, having heard this profound perfection of wisdom, immediately afterward are inclined toward it, are not discouraged, not thoroughly discouraged, not deluded, and have neither hesitation nor doubt, who delight in hearing this profound perfection of wisdom and after hearing this profound perfection of wisdom direct their mind on it, without letting go of their attention, will always follow without interruption those individuals who are not afraid to guard it and who speak of it, whether they are going, coming, standing up, sitting down, or reclining. “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདིའི་དོན་དུ། ནམ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མངོན་དུ་མ་བྱས་དྲན་པས་འདྲིས་པར་མ་བྱས། ཡིད་ཀྱིས་རྟོགས་པར་མ་བྱས། ལྟ་བས་ཁོང་དུ་ཆུད་པར་མ་བྱས་ཀྱི་བར་དུ་ཆོས་སྨྲ་བ་དེ་མི་གཏོང་ན། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་གང་ཟག་དེ་ནི་མིའི་ནང་ནས་ཤི་འཕོས་ནས། མིའི་ནང་དུ་སྐྱེས་པའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Subhūti, just as a milch cow does not abandon her newborn calf, if bodhisattva great beings, for the sake of this profound perfection of wisdom, do not forsake [the teachers] who preach this Dharma until they have brought into being this perfection of wisdom, and have become familiar with it through mindfulness, investigated it with their minds, and comprehended it through the view, then, Subhūti, those individuals who follow the vehicle of the bodhisattvas will pass away among humankind and be reborn among humankind.

source: དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དེས་སྔོན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཐོས་ནས་བཟུང་བ་དང་། བཅངས་པ་དང་། བཀླགས་པ་དང་། ཀུན་ཆུབ་པར་བྱས་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱས་པར་གྱུར་ཏོ།
en: If you ask why, it is because those noble children who follow the vehicle of the bodhisattvas, after hearing, taking up, upholding, reciting, mastering, and focusing their attention correctly on this perfection of wisdom in their former lives—and having, in the aforementioned manner, committed it to writing, compiled it as a book, and then served, respected, honored, and worshiped it with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, and many ribbons—will, through these roots of virtuous action, pass away among humankind and be reborn among humankind.

source: །གོང་དུ་ཡང་བྲིས་ཤིང་གླེགས་བམ་དུ་བྱས་ཏེ། མེ་ཏོག་དང་།
en: One will see that immediately after they have heard of this profound perfection of wisdom they will be inclined toward it.” {

source: ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་མང་པོས་རིམ་གྲོར་བྱས་པར་གྱུར་ཏོ། །བཀུར་བསྟི་དང་། བསྟི་སྟང་དང་། མཆོད་པ་བྱས་པར་གྱུར་ཏོ། །དགེ་བའི་རྩ་བ་དེ་ཉིད་ཀྱིས་མིའི་ནང་ནས་ཤི་འཕོས་ནས་མིའི་ནང་དུ་སྐྱེས་ཏེ།
en: Ki.
